* Start one node cluster

Get in the shell
#+begin_src sh
nix-shell
#+end_src

Check the database is installed by running =cockroachdb=

Initially the DB probably won't start on my mac

#+begin_example
[nix-shell:~/proj/cockroachlabs.com/university]$ just run-single-node-cluster
cockroach start --insecure --listen-addr=localhost:26257 --http-addr=localhost:8080
*
* WARNING: RUNNING IN INSECURE MODE!
*
* - Your cluster is open for any client that can access localhost.
* - Any user, even root, can log in without providing a password.
* - Any user, connecting as root, can read or write any data in your cluster.
* - There is no network encryption nor authentication, and thus no confidentiality.
*
* Check out how to secure your cluster: https://www.cockroachlabs.com/docs/v19.1/secure-a-cluster.html
*
*
* ERROR: cockroach server exited with error: failed to create engines: soft open file descriptor limit of 256 is under the minimum required 1956 and cannot be increased
* please see https://www.cockroachlabs.com/docs/v19.1/recommended-production-settings.html for more details
*
Failed running "start"
error: Recipe `run-single-node-cluster` failed on line 2 with exit code 1

#+end_example

Increase according to the [[https://www.cockroachlabs.com/docs/v19.1/recommended-production-settings.html#yosemite-and-later][docs]].

#+begin_src sh
launchctl limit maxfiles
#+end_src

#+RESULTS:
|   | maxfiles    35000          35000 |

* Backfill

#+begin_example
cockroach workload init movr
#+end_example
* Connect

#+begin_example
cockroach sql --insecure
#+end_example
* Create database & table

#+begin_example sql
CREATE DATABASE crdb_uni;
SET database = crdb_uni;
CREATE TABLE students (id UUID PRIMARY KEY DEFAULT gen_random_uuid(), name STRING);
SHOW CREATE students;
CREATE TABLE courses (sys_id UUID DEFAULT gen_random_uuid(), course_id INT, name STRING, PRIMARY KEY (sys_id, course_id));
SHOW CREATE TABLE courses;
ALTER TABLE courses ADD COLUMN schedule STRING;
SHOW CREATE TABLE courses;
#+end_example
